{"class_name": "Model", "keras_version": "2.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_3", "sparse": false}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_4", "sparse": false}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_5", "sparse": false}, "inbound_nodes": [], "name": "input_5"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_6", "sparse": false}, "inbound_nodes": [], "name": "input_6"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_7", "sparse": false}, "inbound_nodes": [], "name": "input_7"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_8", "sparse": false}, "inbound_nodes": [], "name": "input_8"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "work_class_embedding", "dtype": "float32", "output_dim": 3, "trainable": true, "embeddings_regularizer": null, "input_dim": 7, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 1], "activity_regularizer": null, "input_length": 1}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "work_class_embedding"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "education_embedding", "dtype": "float32", "output_dim": 4, "trainable": true, "embeddings_regularizer": null, "input_dim": 16, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 1], "activity_regularizer": null, "input_length": 1}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "education_embedding"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "marital_status_embedding", "dtype": "float32", "output_dim": 3, "trainable": true, "embeddings_regularizer": null, "input_dim": 7, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 1], "activity_regularizer": null, "input_length": 1}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "marital_status_embedding"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "occupation_embedding", "dtype": "float32", "output_dim": 3, "trainable": true, "embeddings_regularizer": null, "input_dim": 14, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 1], "activity_regularizer": null, "input_length": 1}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "occupation_embedding"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "relationship_embedding", "dtype": "float32", "output_dim": 3, "trainable": true, "embeddings_regularizer": null, "input_dim": 6, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 1], "activity_regularizer": null, "input_length": 1}, "inbound_nodes": [[["input_5", 0, 0, {}]]], "name": "relationship_embedding"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "race_embedding", "dtype": "float32", "output_dim": 2, "trainable": true, "embeddings_regularizer": null, "input_dim": 5, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 1], "activity_regularizer": null, "input_length": 1}, "inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "race_embedding"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "sex_embedding", "dtype": "float32", "output_dim": 1, "trainable": true, "embeddings_regularizer": null, "input_dim": 2, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 1], "activity_regularizer": null, "input_length": 1}, "inbound_nodes": [[["input_7", 0, 0, {}]]], "name": "sex_embedding"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "country_embedding", "dtype": "float32", "output_dim": 10, "trainable": true, "embeddings_regularizer": null, "input_dim": 41, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 1], "activity_regularizer": null, "input_length": 1}, "inbound_nodes": [[["input_8", 0, 0, {}]]], "name": "country_embedding"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 6], "name": "input_9", "sparse": false}, "inbound_nodes": [], "name": "input_9"}, {"class_name": "Reshape", "config": {"target_shape": [3], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["work_class_embedding", 0, 0, {}]]], "name": "reshape_1"}, {"class_name": "Reshape", "config": {"target_shape": [4], "trainable": true, "name": "reshape_2"}, "inbound_nodes": [[["education_embedding", 0, 0, {}]]], "name": "reshape_2"}, {"class_name": "Reshape", "config": {"target_shape": [3], "trainable": true, "name": "reshape_3"}, "inbound_nodes": [[["marital_status_embedding", 0, 0, {}]]], "name": "reshape_3"}, {"class_name": "Reshape", "config": {"target_shape": [3], "trainable": true, "name": "reshape_4"}, "inbound_nodes": [[["occupation_embedding", 0, 0, {}]]], "name": "reshape_4"}, {"class_name": "Reshape", "config": {"target_shape": [3], "trainable": true, "name": "reshape_5"}, "inbound_nodes": [[["relationship_embedding", 0, 0, {}]]], "name": "reshape_5"}, {"class_name": "Reshape", "config": {"target_shape": [2], "trainable": true, "name": "reshape_6"}, "inbound_nodes": [[["race_embedding", 0, 0, {}]]], "name": "reshape_6"}, {"class_name": "Reshape", "config": {"target_shape": [1], "trainable": true, "name": "reshape_7"}, "inbound_nodes": [[["sex_embedding", 0, 0, {}]]], "name": "reshape_7"}, {"class_name": "Reshape", "config": {"target_shape": [10], "trainable": true, "name": "reshape_8"}, "inbound_nodes": [[["country_embedding", 0, 0, {}]]], "name": "reshape_8"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_9", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["reshape_1", 0, 0, {}], ["reshape_2", 0, 0, {}], ["reshape_3", 0, 0, {}], ["reshape_4", 0, 0, {}], ["reshape_5", 0, 0, {}], ["reshape_6", 0, 0, {}], ["reshape_7", 0, 0, {}], ["reshape_8", 0, 0, {}], ["dense_1", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 25, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dense_2"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 15, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_3"}, {"class_name": "Dropout", "config": {"rate": 0.1, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_4"}, {"class_name": "Dropout", "config": {"rate": 0.1, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_3"}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dropout_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "dense_5"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0], ["input_5", 0, 0], ["input_6", 0, 0], ["input_7", 0, 0], ["input_8", 0, 0], ["input_9", 0, 0]], "output_layers": [["dense_5", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}